In [1]:
import pandas as pd
# Cria um DataFrame
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [53]:
df = pd.DataFrame(data)

In [55]:
df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
group = df.groupby('Empresa')

In [8]:
group

In [9]:
group.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [11]:
group.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [13]:
group.count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [14]:
group2 = df.groupby('Nome')

In [16]:
group2

In [17]:
group2.sum()

         Venda
Nome
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [20]:
group2.sum().loc['Amy']

Venda    340
Name: Amy, dtype: int64

In [94]:
#operações com pandas
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [57]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [25]:
import numpy as np

In [27]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

In [28]:
len(df['col2'].unique())

3

In [30]:
df['col2'].nunique()

3

In [32]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [36]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [37]:
df[(df['col1']>2)&(df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [40]:
def vezes2(x):
    return x*2

In [41]:
df['col1'].apply(vezes2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [45]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [47]:
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [49]:
del df['col2']
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [51]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [52]:
df.columns

Index(['col1', 'col3'], dtype='object')

In [59]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [61]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [72]:
df.dropna()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [95]:
df.at[0, 'col2']=np.nan

In [97]:
df

   col1   col2 col3
0     1    NaN  abc
1     2  555.0  def
2     3  666.0  ghi
3     4  444.0  xyz

In [113]:
df['col2'].fillna(value=df['col2'].mean())

0    555.0
1    555.0
2    666.0
3    444.0
Name: col2, dtype: float64

In [114]:
df

   col1   col2 col3
0     1    NaN  abc
1     2  555.0  def
2     3  666.0  ghi
3     4  444.0  xyz

In [117]:
Outrodf= {'A':['foo','foo','foo','bar','bar','bar'],
         'B':['one','one','two','two','one','one'],
         'C':['x','y','x','y','x','y'],
         'D':[1,3,2,5,4,1]}
df2= pd.DataFrame(Outrodf)
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [121]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

KeyError: 'D'